<template>
  <q-page class="flex flex-center">

  <div class="q-pa-md">
      <div class="btn-group">
        <router-link class = "btn" to="/light">光明真言</router-link>
        <router-link class = "btn" to="/ten">十小咒</router-link>
        <router-link class = "btn" to="/dabei">大悲咒</router-link>
        <router-link class = "btn" to="/lengyan">楞嚴咒</router-link>
        <router-link class = "btn" to="/">回首頁</router-link>
      </div>
    選擇顯示：
    <q-checkbox v-model="showA" />拼音
    <q-checkbox v-model="showB" />中文發音
    <q-checkbox v-model="showC" />意譯
  </div>

    <div class="pad thin-only">

    <h3>楞嚴咒<div style="max-width: 60px; width: 100%;">
    <q-media-player
      type="audio"
      :sources="sources"
    />
  </div></h3>

    <p v-show="showB">南無楞嚴會上佛菩薩 (三稱) <br/>

妙湛總持不動尊 首楞嚴王世稀有<br/>

銷我億劫顛倒想 不歷僧祇獲法身<br/>

願今得果成寶王 還度如是恒沙眾<br/>

將此深心奉塵刹 是則名為報佛恩<br/>

伏請世尊為證明 五濁惡世誓先入<br/>

如一眾生未成佛 終不於此取泥洹<br/>

大雄大力大慈悲 希更審除微細惑<br/>

令我早登無上覺 於十方界坐道場<br/>

舜若多性可銷亡 爍迦羅心無動轉<br/>

南無常住十方佛 南無常住十方法<br/>

南無常住十方僧 南無釋迦牟尼佛<br/>

南無佛頂首楞嚴 南無觀世音菩薩<br/>

南無金剛藏菩薩<br/>

　

爾時世尊從肉髻中涌百寶光。光中涌出千葉寶蓮。有化如來坐寶花中。頂放十道百寶光明。一一光明皆遍示現十恆河沙。金剛密跡擎山持杵遍虛空界。大眾仰觀畏愛兼抱求佛哀祐。一心聽佛。無見頂相放光如來宣說神咒。<br/>

(第一會)<br/>

南無薩怛他蘇伽多耶阿囉訶帝三藐三菩陀寫<br/>
薩怛他佛陀俱胝瑟尼釤<br/>
南無薩婆勃陀勃地薩跢鞞弊<br/>
南無薩多南三藐三菩陀俱知喃<br/>
娑舍囉婆迦僧伽喃<br/>
南無盧雞阿羅漢跢喃<br/>
南無蘇盧多波那喃<br/>
南無娑羯唎陀伽彌喃<br/>
南無盧雞三藐伽跢喃<br/>
三藐伽波囉底波多那喃<br/>
南無提婆離瑟赧<br/>
南無悉陀耶毗地耶陀囉離瑟赧<br/>
舍波奴揭囉訶娑訶娑囉摩他喃<br/>
南無跋囉訶摩尼<br/>
南無因陀囉耶<br/>
南無婆伽婆帝<br/>
嚧陀囉耶<br/>
烏摩般帝<br/>
娑醯夜耶<br/>
南無婆伽婆帝<br/>
那囉野拏耶<br/>
槃遮摩訶三慕陀囉<br/>
南無悉羯唎多耶<br/>
南無婆伽婆帝<br/>
摩訶迦囉耶<br/>
地唎般剌那伽囉<br/>
毗陀囉波拏迦囉耶<br/>
阿地目帝<br/>
尸摩舍那泥婆悉泥<br/>
摩怛唎伽拏<br/>
南無悉羯唎多耶<br/>
南無婆伽婆帝<br/>
多他伽跢俱囉耶<br/>
南無般頭摩俱囉耶<br/>
南無跋闍囉俱囉耶<br/>
南無摩尼俱囉耶<br/>
南無伽闍俱囉耶<br/>
南無婆伽婆帝<br/>
帝唎茶輸囉西那<br/>
波囉訶囉拏囉闍耶<br/>
跢他伽多耶<br/>
南無婆伽婆帝<br/>
南無阿彌多婆耶<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
南無婆伽婆帝<br/>
阿芻鞞耶<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
南無婆伽婆帝<br/>
鞞沙闍耶俱盧吠柱唎耶<br/>
般囉婆囉闍耶<br/>
跢他伽多耶<br/>
南無婆伽婆帝<br/>
三補師毖多<br/>
薩憐捺囉剌闍耶<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
南無婆伽婆帝<br/>
舍雞野母那曳<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
南無婆伽婆帝<br/>
剌怛那雞都囉闍耶<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
帝瓢南無薩羯唎多<br/>
翳曇婆伽婆多<br/>
薩怛他伽都瑟尼釤<br/>
薩怛多般怛藍<br/>
南無阿婆囉視耽<br/>
般囉帝揚岐囉<br/>
薩囉婆部多揭囉訶<br/>
尼揭囉訶羯迦囉訶尼<br/>
跋囉毖地耶叱陀你<br/>
阿迦囉蜜唎柱<br/>
般唎怛囉耶儜揭唎<br/>
薩囉婆槃陀那目叉尼<br/>
薩囉婆突瑟吒<br/>
突悉乏般那你伐囉尼<br/>
赭都囉失帝南<br/>
羯囉訶娑訶薩囉若闍<br/>
毗多崩娑那羯唎<br/>
阿瑟吒冰舍帝南<br/>
那叉刹怛囉若闍<br/>
波囉薩陀那羯唎<br/>
阿瑟吒南<br/>
摩訶揭囉訶若闍<br/>
毗多崩薩那羯唎<br/>
薩婆舍都嚧你婆囉若闍<br/>
呼藍突悉乏難遮那舍尼<br/>
毖沙舍悉怛囉<br/>
阿吉尼烏陀迦囉若闍<br/>
阿般囉視多具囉<br/>
摩訶般囉戰持<br/>
摩訶疊多<br/>
摩訶帝闍<br/>
摩訶稅多闍婆囉<br/>
摩訶跋囉槃陀囉婆悉你<br/>
阿唎耶多囉<br/>
毗唎俱知<br/>
誓婆毗闍耶<br/>
跋闍囉摩禮底<br/>
毗舍嚧多<br/>
勃騰罔迦<br/>
跋闍囉制喝那阿遮<br/>
摩囉制婆般囉質多<br/>
跋闍囉擅持<br/>
毗舍囉遮<br/>
扇多舍鞞提婆補視多<br/>
蘇摩嚧波<br/>
摩訶稅多<br/>
阿唎耶多囉<br/>
摩訶婆囉阿般囉<br/>
跋闍囉商揭囉制婆<br/>
跋闍囉俱摩唎<br/>
俱藍陀唎<br/>
跋闍囉喝薩多遮<br/>
毗地耶乾遮那摩唎迦<br/>
啒蘇母婆羯囉多那<br/>
鞞嚧遮那俱唎耶<br/>
夜囉菟瑟尼釤<br/>
毗折藍婆摩尼遮<br/>
跋闍囉迦那迦波囉婆<br/>
嚧闍那<br/>
跋闍囉頓稚遮<br/>
稅多遮迦摩囉<br/>
刹奢尸波囉婆<br/>
翳帝夷帝<br/>
母陀囉羯拏<br/>
娑鞞囉懺<br/>
掘梵都<br/>
印兔那麼麼寫<br/>

(第二會)<br/>

烏信<br/>
唎瑟揭拏<br/>
般刺舍悉多<br/>
薩怛他伽都瑟尼釤<br/>
虎信<br/>
都盧雍<br/>
瞻婆那<br/>
虎信<br/>
都盧雍<br/>
悉耽婆那<br/>
虎信<br/>
都盧雍<br/>
波羅瑟地耶三般叉拏羯囉<br/>
虎信<br/>
都盧雍<br/>
薩婆藥叉喝囉刹娑<br/>
揭囉訶若闍<br/>
毗騰崩薩那羯囉<br/>
虎信<br/>
都盧雍<br/>
者都囉尸底南<br/>
揭囉訶娑訶薩囉南<br/>
毗騰崩薩那囉<br/>
虎信<br/>
都盧雍<br/>
囉叉<br/>
婆伽梵<br/>
薩怛他伽都瑟尼釤<br/>
波囉點闍吉唎<br/>
摩訶娑訶薩囉<br/>
勃樹娑訶薩囉室唎沙<br/>
俱知娑訶薩泥帝隸<br/>
阿弊提視婆唎多<br/>
吒吒甖迦<br/>
摩訶跋闍嚧陀囉<br/>
帝唎菩婆那<br/>
曼茶囉<br/>
烏信<br/>
莎悉帝薄婆都<br/>
麼麼<br/>
印兔那麼麼寫<br/>

(第三會)<br/>

囉闍婆夜<br/>
主囉跋夜<br/>
阿祇尼婆夜<br/>
烏陀迦婆夜<br/>
毗沙婆夜<br/>
舍薩多囉婆夜<br/>
婆囉斫羯囉婆夜<br/>
突瑟叉婆夜<br/>
阿舍你婆夜<br/>
阿迦囉蜜唎柱婆夜<br/>
陀囉尼部彌劍波伽波陀婆夜<br/>
烏囉迦婆多婆夜<br/>
剌闍壇茶婆夜<br/>
那伽婆夜<br/>
毗條怛婆夜<br/>
蘇波囉拏婆夜<br/>
藥叉揭囉訶<br/>
囉叉私揭囉訶<br/>
畢唎多揭囉訶<br/>
毗舍遮揭囉訶<br/>
部多揭囉訶<br/>
鳩槃茶揭囉訶<br/>
補單那揭囉訶<br/>
迦吒補單那揭囉訶<br/>
悉乾度揭囉訶<br/>
阿播悉摩囉揭囉訶<br/>
烏檀摩陀揭囉訶<br/>
車夜揭囉訶<br/>
醯唎婆帝揭囉訶<br/>
社多訶唎南<br/>
揭婆訶唎南<br/>
嚧地囉訶唎南<br/>
忙娑訶唎南<br/>
謎陀訶唎南<br/>
摩闍訶唎南<br/>
闍多訶唎女<br/>
視比多訶唎南<br/>
毗多訶唎南<br/>
婆多訶唎南<br/>
阿輸遮訶唎女<br/>
質多訶唎女<br/>
帝釤薩鞞釤<br/>
薩婆揭囉訶南<br/>
毗陀耶闍嗔陀夜彌<br/>
雞囉夜彌<br/>
波唎跋囉者迦訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
茶演尼訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
摩訶般輸般怛夜<br/>
嚧陀囉訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
那囉夜拏訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
怛埵伽嚧茶西訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
摩訶迦囉摩怛唎伽拏訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
迦波唎迦訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
闍耶羯囉摩度羯囉<br/>
薩婆囉他娑達那訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
赭咄囉婆耆你訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
毗唎羊訖唎知<br/>
難陀雞沙囉伽拏般帝<br/>
索醯夜訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
那揭那舍囉婆拏訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
阿羅漢訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
毗多囉伽訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
跋闍囉波你<br/>
具醯夜具醯夜<br/>
迦地般帝訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
囉叉罔<br/>
婆伽梵<br/>
印兔那麼麼寫<br/>
 
(第四會)<br/>
婆伽梵<br/>
薩怛多般怛囉<br/>
南無粹都帝<br/>
阿悉多那囉剌迦<br/>
波囉婆悉普吒<br/>
毗迦薩怛多鉢帝唎<br/>
什佛囉什佛囉<br/>
陀囉陀囉<br/>
頻陀囉頻陀囉嗔陀嗔陀<br/>
虎信<br/>
虎信<br/>
泮吒<br/>
泮吒泮吒泮吒泮吒<br/>
娑訶<br/>
醯醯泮<br/>
阿牟迦耶泮<br/>
阿波囉提訶多泮<br/>
婆囉波囉陀泮<br/>
阿素囉毗陀囉波迦泮<br/>
薩婆提鞞弊泮<br/>
薩婆那伽弊泮<br/>
薩婆藥叉弊泮<br/>
薩婆乾闥婆弊泮<br/>
薩婆補丹那弊泮<br/>
迦吒補丹那弊泮<br/>
薩婆突狼枳帝弊泮<br/>
薩婆突澁比犁訖瑟帝弊泮<br/>
薩婆什婆利弊泮<br/>
薩婆阿播悉摩犁弊泮<br/>
薩婆舍囉婆拏弊泮<br/>
薩婆地帝雞弊泮<br/>
薩婆怛摩陀繼弊泮<br/>
薩婆毗陀耶囉誓遮犁弊泮<br/>
闍夜羯囉摩度羯囉<br/>
薩婆囉他娑陀雞弊泮<br/>
毗地夜遮唎弊泮<br/>
者都囉縛耆你弊泮<br/>
跋闍囉俱摩唎<br/>
毗陀夜囉誓弊泮<br/>
摩訶波囉丁羊乂耆唎弊泮<br/>
跋闍囉商羯囉夜<br/>
波囉丈耆囉闍耶泮<br/>
摩訶迦囉夜<br/>
摩訶末怛唎迦拏<br/>
南無娑羯唎多夜泮<br/>
毖瑟拏婢曳泮<br/>
勃囉訶牟尼曳泮<br/>
阿耆尼曳泮<br/>
摩訶羯唎曳泮<br/>
羯囉檀遲曳泮<br/>
蔑怛唎曳泮<br/>
嘮怛唎曳泮<br/>
遮文茶曳泮<br/>
羯邏囉怛唎曳泮<br/>
迦般唎曳泮<br/>
阿地目質多迦尸摩舍那<br/>
婆私你曳泮<br/>
演吉質<br/>
薩埵婆寫<br/>
麼麼印兔那麼麼寫<br/>

(第五會)<br/>
突瑟吒質多<br/>
阿末怛唎質多<br/>
烏闍訶囉<br/>
伽婆訶囉<br/>
嚧地囉訶囉<br/>
婆娑訶囉<br/>
摩闍訶囉<br/>
闍多訶囉<br/>
視毖多訶囉<br/>
跋略夜訶囉<br/>
乾陀訶囉<br/>
布史波訶囉<br/>
頗囉訶囉<br/>
婆寫訶囉<br/>
般波質多<br/>
突瑟吒質多<br/>
嘮陀囉質多<br/>
藥叉揭囉訶<br/>
囉刹娑揭囉訶<br/>
閉隸多揭囉訶<br/>
毗舍遮揭囉訶<br/>
部多揭囉訶<br/>
鳩槃茶揭囉訶<br/>
悉乾陀揭囉訶<br/>
烏怛摩陀揭囉訶<br/>
車夜揭囉訶<br/>
阿播薩摩囉揭囉訶<br/>
宅袪革茶耆尼揭囉訶<br/>
唎佛帝揭囉訶<br/>
闍彌迦揭囉訶<br/>
舍俱尼揭囉訶<br/>
姥陀囉難地迦揭囉訶<br/>
阿藍婆揭囉訶<br/>
乾度波尼揭囉訶<br/>
什伐囉堙迦醯迦<br/>
墜帝藥迦<br/>
怛隸帝藥迦<br/>
者突託迦<br/>
尼提什伐囉毖釤摩什伐囉<br/>
薄底迦<br/>
鼻底迦<br/>
室隸瑟密迦<br/>
娑你般帝迦<br/>
薩婆什伐囉<br/>
室嚧吉帝<br/>
末陀鞞達嚧制劍<br/>
阿綺嚧鉗<br/>
目佉嚧鉗<br/>
羯唎突嚧鉗<br/>
揭囉訶揭藍<br/>
羯拏輸藍<br/>
憚多輸藍<br/>
迄唎夜輸藍<br/>
末麼輸藍<br/>
跋唎室婆輸藍<br/>
毖栗瑟吒輸藍<br/>
烏陀囉輸藍<br/>
羯知輸藍<br/>
跋悉帝輸藍<br/>
鄔嚧輸藍<br/>
常伽輸藍<br/>
喝悉多輸藍<br/>
跋陀輸藍<br/>
娑房盎伽般囉丈伽輸藍<br/>
部多毖哆茶<br/>
茶耆尼什婆囉<br/>
陀突嚧迦建咄嚧吉知婆路多毗<br/>
薩般嚧訶凌伽<br/>
輸沙怛囉<br/>
娑那羯囉<br/>
毗沙喻迦<br/>
阿耆尼烏陀迦<br/>
末囉鞞囉建跢囉<br/>
阿迦囉蜜唎咄怛斂部迦<br/>
地栗剌吒<br/>
毖唎瑟質迦<br/>
薩婆那俱囉<br/>
肆引伽弊揭囉唎藥叉怛囉芻<br/>
末囉視吠帝釤娑鞞釤<br/>
悉怛多鉢怛囉<br/>
摩訶跋闍嚧瑟尼釤<br/>
摩訶般賴丈耆藍<br/>
夜波突陀舍喻闍那<br/>
辮怛隸拏<br/>
毗陀耶槃曇迦嚧彌<br/>
帝殊槃曇迦嚧彌<br/>
般囉毘陀槃曇迦嚧彌<br/>
哆姪他<br/>
唵<br/>
阿那隸<br/>
毘舍提<br/>
鞞囉跋闍囉陀唎<br/>
槃陀槃陀你<br/>
跋闍囉謗尼泮<br/>
虎信都嚧甕泮<br/>
莎婆訶</p>


    <p v-show="showC">我今敬禮。皈命一切如來應正等覺。皈命一切諸佛大佛頂首。皈命諸大菩薩。至心承事賢聖。普禮一切聖眾。敬禮三世正徧知覺。敬禮大辟支佛。敬禮大阿羅漢。敬禮須陁洹。敬禮斯陁含。敬禮阿那含。敬禮過未現在諸聖賢眾。敬禮諸天仙眾。敬禮咒術天仙聖眾。惟願攝惡行善。皈命大梵天眾。皈命帝釋天主。自在天等眷屬。及諸地祇等眾。護大印咒神將。頂禮世尊。大梵天眾。天將眾。天曹眾。天神眾。天兵眾。天男女眾。如來種族眾。蓮花王種族菩薩眾。金剛族眾。寶王族眾。地祇族眾。各持器仗大力猛將。此即普禮一切賢聖。皈命無量壽佛。普禮如來一切門人。普禮應真一切王族。皈命正覺一切聖賢。敬禮阿閦如來。皈命藥師瑠璃光佛。敬普光娑羅王眾。皈佛大弟子眾。敬禮寶光寶幢王眾。我今皈依敬禮。至今發心願學。我今敬禮結華葢頂。我禮今會諸聖。普求證明。代佛宣物秘密一切神眾。斷他人咒。解去橫死。冤家眾。救拔一切冤苦。解釋一切禁縛。除滅一切惡夢。及不祥事。八萬四千金剛眾。護持千界神眾。打破諸害。護戒神眾。護伽藍一切八部神眾。護法善神。皈戒善神。護五方神兵眾。同上破害。除滅一切諸惡。除滅眾死。天神器仗。消滅火毒。解除水毒。勝莊嚴諸聖眾。大力瞋怒王眾。火天眾。虛空天眾。觀光天眾。大力天神眾。答問神眾。大聖神眾。最勝王眾。摧碎金剛。神眾。降伏一切。金剛力士。金剛寶杵眾。金剛寶劍神。天神力士。天才力士。日月星宮天子。五星二十八宿。謂西方太白星。北方水星。南方熒惑星。中方鎮星。東方歲星等。金剛連鎖甲。金剛童男眾。金剛神女眾。金剛巨手。大明咒藏。四天王太子。三光天王眷屬。毗盧神名。天王部下神眾。大佛頂。光神眾。羅剎神名。金剛使者燈樂香花神眾。擎山金剛神眾。如是恆沙力士等眾。諸佛印咒。警覺一切。押領一切部眾。我等天仙。今當敬禮如來大佛頂咒。各領鎮中。各令加護。總攝諸魔。此摧一切惡鬼。我今警覺八萬四千金剛神王。金剛天仙。各令守護。惟仗世尊威神力故。皈命大佛頂光。我今作禮。千臂大神。千頭大神。千百眼大神。敬禮大輪金剛神。皈命三世諸佛。設此壇場。再敕一切。普令諸部神眾。常護隨從。除王難。除賊難。除火難。除風難。除毒難。除刀難。除兵難。除饑饉難。除雷電難。阿迦下除橫死非命難。得總持力。除一切災害難。除險阻難。除毒蛇難。除毒龍難。除熌電難。除金翅鳥難。守魂鬼。守宮婦女鬼。除非命難。守尸鬼。守穀鬼。除毒藥難。大神鬼。鳩句騎坐鬼。除城郭車騎難。守形鬼。守魄鬼。童子神。羊頭神。熱鬼。影鬼。音鬼。食精氣鬼。食胎藏鬼。食血鬼。食油鬼。食產鬼。食命鬼。食垢膩鬼。食祭鬼。食花鬼。食菓鬼。食五穀種子鬼。食燈鬼。如是等眾。一切熱惱祖父神鬼。大明咒藏。斬依罪者咒。捕捉夜叉王咒。有三神將。押領二十八萬軍眾。狐魅鬼眾。大自在天眾。自在天眾。金翅鳥王神眾。大小黑天神眾。髑髏外道神仙眾。執持一切人物神王軍將。神女姊妹。鬬戰勝神將前器仗。幷及孔雀明王器仗。裸形外道神眾。降伏羅剎王眾。大力神王。執劍金剛神王。及與密跡力士。婆伽梵總管也。仰白世尊。願仗神力普令一切眾生。常蒙加護。再仰佛力華葢。我今敬禮。赤光繚繞。紫光盤簇。白光旋轉。光燄徧照。雲葢。香葢。珠葢。徧滿法界。敕天上地下一切眾。滅除眾惡。收攝不祥。解脫一切。不空我願。願無障礙。所願隨心。破碎修羅。降伏一切天神眾。降伏一切毒龍眾眾。藥叉。降伏一切勇猛。鬼神。降伏一切音樂眾。一切鬼來讚禮。一切鬼奇皈敬。降伏諸魔。降伏諸惡。破諸幽暗。破諸冤業。破諸災厄。破諸冤害。破一切非命。破一切毒氣。解諸重難。解瘧壯熱。降伏外道。解諸惡毒。伏諸厄難。降伏一切惡道。降伏一切苦毒。降伏諸惡毒師。降伏惡毒咒王。伏火天神。降大黑天神女。黑面神玉女眾。天帝釋眾。瞋怒神王。噉人大神。喝山大神。食光大神。諸持作大鬼帥。及一切有力鬼神。普令諸惡鬼神。悉皆摧碎。惡心鬼。惡毒鬼。食精鬼。食胎鬼。食血鬼。食油鬼。食產鬼。食肉鬼。食命鬼。食祭鬼。食香鬼。食花鬼。食菓鬼。食種子鬼。惡形鬼。惡眼鬼。巨頭鬼。以佛菩薩。現千百億身手。降伏一切大力鬼神。藥叉。吞火鬼。吞水鬼。交手鬼。交足鬼。交身鬼。分形鬼。吐烟鬼。吐火鬼。形影鬼。羊頭瞋鬼。刑人狐鬼。狸魅女鬼。惱小兒鬼。形如女面。如烏鬼。如鳥鬼。如猫鬼。如蛇。鬼。如雞鬼。壯熱鬼。一日瘧鬼。二日瘧鬼。三日瘧鬼。五日瘧鬼。常熱鬼。增寒鬼。風病鬼。黃病鬼。疫病鬼。痢病鬼。頭病鬼。不食鬼。口痛鬼。齒痛鬼。唇痛鬼。身病鬼。頤頷痛鬼。心痛鬼。頭痛鬼。兩脇痛鬼。背痛鬼。腹痛鬼。腰痛鬼。踝痛鬼。腿痛鬼。腕痛鬼。兩手痛鬼。四肢骨節痛鬼。兩膊痛鬼。尸林鬼。魅鬼。一切瘡鬼。蜘蛛瘡鬼。疔瘡鬼。漫淫瘡鬼。赤瘡鬼。小兒瘡鬼。顛狂鬼。癩瘡鬼。火毒鬼。水毒鬼。女死鬼。橫死鬼。藥草毒鬼。蝎毒鬼。蛇毒鬼。虎狼毒鬼。獅子毒鬼。一切惡毒鬼。熊羆毒鬼。用制此類一切惡鬼。悉皆畏伏。花葢也。啟火金剛藏王。警力士眾。佛頂光聚大明心咒。不得入我結縛界內。十二由旬結界地面。禁縛諸惡。一切邪魔惡鬼神王。不能進入擾害。此咒能縛諸惡鬼神。我今說此咒心。乃宣佛敕。一切眾類。仰如來力。聞誦此咒。悉當合掌恭敬頂禮。汝等承佛威力。各來衛護。行住坐臥。不相捨離。再嚴伏一切朋黨眷屬。汝等諦聽。各歸其所。向無上道。直至菩提。</p>

    </div>

    <table class="styled-table container fat-only">
      <thead>
        <tr><th>咒文</th><th v-show="showA">羅馬拼音</th><th v-show="showB">漢語音譯</th><th class="wide" v-show="showC">意譯</th></tr>
      </thead>

      <tbody>
      
        <tr>
          <td>楞嚴咒<div style="max-width: 260px; width: 100%;">
    <q-media-player
      type="audio"
      :sources="sources"
    />
  </div></td>

          <td v-show="showA"></td>

    <td v-show="showB">南無楞嚴會上佛菩薩 (三稱) <br/>

妙湛總持不動尊 首楞嚴王世稀有<br/>

銷我億劫顛倒想 不歷僧祇獲法身<br/>

願今得果成寶王 還度如是恒沙眾<br/>

將此深心奉塵刹 是則名為報佛恩<br/>

伏請世尊為證明 五濁惡世誓先入<br/>

如一眾生未成佛 終不於此取泥洹<br/>

大雄大力大慈悲 希更審除微細惑<br/>

令我早登無上覺 於十方界坐道場<br/>

舜若多性可銷亡 爍迦羅心無動轉<br/>

南無常住十方佛 南無常住十方法<br/>

南無常住十方僧 南無釋迦牟尼佛<br/>

南無佛頂首楞嚴 南無觀世音菩薩<br/>

南無金剛藏菩薩<br/>

　

爾時世尊從肉髻中涌百寶光。光中涌出千葉寶蓮。有化如來坐寶花中。頂放十道百寶光明。一一光明皆遍示現十恆河沙。金剛密跡擎山持杵遍虛空界。大眾仰觀畏愛兼抱求佛哀祐。一心聽佛。無見頂相放光如來宣說神咒。<br/>

(第一會)<br/>

南無薩怛他蘇伽多耶阿囉訶帝三藐三菩陀寫<br/>
薩怛他佛陀俱胝瑟尼釤<br/>
南無薩婆勃陀勃地薩跢鞞弊<br/>
南無薩多南三藐三菩陀俱知喃<br/>
娑舍囉婆迦僧伽喃<br/>
南無盧雞阿羅漢跢喃<br/>
南無蘇盧多波那喃<br/>
南無娑羯唎陀伽彌喃<br/>
南無盧雞三藐伽跢喃<br/>
三藐伽波囉底波多那喃<br/>
南無提婆離瑟赧<br/>
南無悉陀耶毗地耶陀囉離瑟赧<br/>
舍波奴揭囉訶娑訶娑囉摩他喃<br/>
南無跋囉訶摩尼<br/>
南無因陀囉耶<br/>
南無婆伽婆帝<br/>
嚧陀囉耶<br/>
烏摩般帝<br/>
娑醯夜耶<br/>
南無婆伽婆帝<br/>
那囉野拏耶<br/>
槃遮摩訶三慕陀囉<br/>
南無悉羯唎多耶<br/>
南無婆伽婆帝<br/>
摩訶迦囉耶<br/>
地唎般剌那伽囉<br/>
毗陀囉波拏迦囉耶<br/>
阿地目帝<br/>
尸摩舍那泥婆悉泥<br/>
摩怛唎伽拏<br/>
南無悉羯唎多耶<br/>
南無婆伽婆帝<br/>
多他伽跢俱囉耶<br/>
南無般頭摩俱囉耶<br/>
南無跋闍囉俱囉耶<br/>
南無摩尼俱囉耶<br/>
南無伽闍俱囉耶<br/>
南無婆伽婆帝<br/>
帝唎茶輸囉西那<br/>
波囉訶囉拏囉闍耶<br/>
跢他伽多耶<br/>
南無婆伽婆帝<br/>
南無阿彌多婆耶<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
南無婆伽婆帝<br/>
阿芻鞞耶<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
南無婆伽婆帝<br/>
鞞沙闍耶俱盧吠柱唎耶<br/>
般囉婆囉闍耶<br/>
跢他伽多耶<br/>
南無婆伽婆帝<br/>
三補師毖多<br/>
薩憐捺囉剌闍耶<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
南無婆伽婆帝<br/>
舍雞野母那曳<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
南無婆伽婆帝<br/>
剌怛那雞都囉闍耶<br/>
跢他伽多耶<br/>
阿囉訶帝<br/>
三藐三菩陀耶<br/>
帝瓢南無薩羯唎多<br/>
翳曇婆伽婆多<br/>
薩怛他伽都瑟尼釤<br/>
薩怛多般怛藍<br/>
南無阿婆囉視耽<br/>
般囉帝揚岐囉<br/>
薩囉婆部多揭囉訶<br/>
尼揭囉訶羯迦囉訶尼<br/>
跋囉毖地耶叱陀你<br/>
阿迦囉蜜唎柱<br/>
般唎怛囉耶儜揭唎<br/>
薩囉婆槃陀那目叉尼<br/>
薩囉婆突瑟吒<br/>
突悉乏般那你伐囉尼<br/>
赭都囉失帝南<br/>
羯囉訶娑訶薩囉若闍<br/>
毗多崩娑那羯唎<br/>
阿瑟吒冰舍帝南<br/>
那叉刹怛囉若闍<br/>
波囉薩陀那羯唎<br/>
阿瑟吒南<br/>
摩訶揭囉訶若闍<br/>
毗多崩薩那羯唎<br/>
薩婆舍都嚧你婆囉若闍<br/>
呼藍突悉乏難遮那舍尼<br/>
毖沙舍悉怛囉<br/>
阿吉尼烏陀迦囉若闍<br/>
阿般囉視多具囉<br/>
摩訶般囉戰持<br/>
摩訶疊多<br/>
摩訶帝闍<br/>
摩訶稅多闍婆囉<br/>
摩訶跋囉槃陀囉婆悉你<br/>
阿唎耶多囉<br/>
毗唎俱知<br/>
誓婆毗闍耶<br/>
跋闍囉摩禮底<br/>
毗舍嚧多<br/>
勃騰罔迦<br/>
跋闍囉制喝那阿遮<br/>
摩囉制婆般囉質多<br/>
跋闍囉擅持<br/>
毗舍囉遮<br/>
扇多舍鞞提婆補視多<br/>
蘇摩嚧波<br/>
摩訶稅多<br/>
阿唎耶多囉<br/>
摩訶婆囉阿般囉<br/>
跋闍囉商揭囉制婆<br/>
跋闍囉俱摩唎<br/>
俱藍陀唎<br/>
跋闍囉喝薩多遮<br/>
毗地耶乾遮那摩唎迦<br/>
啒蘇母婆羯囉多那<br/>
鞞嚧遮那俱唎耶<br/>
夜囉菟瑟尼釤<br/>
毗折藍婆摩尼遮<br/>
跋闍囉迦那迦波囉婆<br/>
嚧闍那<br/>
跋闍囉頓稚遮<br/>
稅多遮迦摩囉<br/>
刹奢尸波囉婆<br/>
翳帝夷帝<br/>
母陀囉羯拏<br/>
娑鞞囉懺<br/>
掘梵都<br/>
印兔那麼麼寫<br/>

(第二會)<br/>

烏信<br/>
唎瑟揭拏<br/>
般刺舍悉多<br/>
薩怛他伽都瑟尼釤<br/>
虎信<br/>
都盧雍<br/>
瞻婆那<br/>
虎信<br/>
都盧雍<br/>
悉耽婆那<br/>
虎信<br/>
都盧雍<br/>
波羅瑟地耶三般叉拏羯囉<br/>
虎信<br/>
都盧雍<br/>
薩婆藥叉喝囉刹娑<br/>
揭囉訶若闍<br/>
毗騰崩薩那羯囉<br/>
虎信<br/>
都盧雍<br/>
者都囉尸底南<br/>
揭囉訶娑訶薩囉南<br/>
毗騰崩薩那囉<br/>
虎信<br/>
都盧雍<br/>
囉叉<br/>
婆伽梵<br/>
薩怛他伽都瑟尼釤<br/>
波囉點闍吉唎<br/>
摩訶娑訶薩囉<br/>
勃樹娑訶薩囉室唎沙<br/>
俱知娑訶薩泥帝隸<br/>
阿弊提視婆唎多<br/>
吒吒甖迦<br/>
摩訶跋闍嚧陀囉<br/>
帝唎菩婆那<br/>
曼茶囉<br/>
烏信<br/>
莎悉帝薄婆都<br/>
麼麼<br/>
印兔那麼麼寫<br/>

(第三會)<br/>

囉闍婆夜<br/>
主囉跋夜<br/>
阿祇尼婆夜<br/>
烏陀迦婆夜<br/>
毗沙婆夜<br/>
舍薩多囉婆夜<br/>
婆囉斫羯囉婆夜<br/>
突瑟叉婆夜<br/>
阿舍你婆夜<br/>
阿迦囉蜜唎柱婆夜<br/>
陀囉尼部彌劍波伽波陀婆夜<br/>
烏囉迦婆多婆夜<br/>
剌闍壇茶婆夜<br/>
那伽婆夜<br/>
毗條怛婆夜<br/>
蘇波囉拏婆夜<br/>
藥叉揭囉訶<br/>
囉叉私揭囉訶<br/>
畢唎多揭囉訶<br/>
毗舍遮揭囉訶<br/>
部多揭囉訶<br/>
鳩槃茶揭囉訶<br/>
補單那揭囉訶<br/>
迦吒補單那揭囉訶<br/>
悉乾度揭囉訶<br/>
阿播悉摩囉揭囉訶<br/>
烏檀摩陀揭囉訶<br/>
車夜揭囉訶<br/>
醯唎婆帝揭囉訶<br/>
社多訶唎南<br/>
揭婆訶唎南<br/>
嚧地囉訶唎南<br/>
忙娑訶唎南<br/>
謎陀訶唎南<br/>
摩闍訶唎南<br/>
闍多訶唎女<br/>
視比多訶唎南<br/>
毗多訶唎南<br/>
婆多訶唎南<br/>
阿輸遮訶唎女<br/>
質多訶唎女<br/>
帝釤薩鞞釤<br/>
薩婆揭囉訶南<br/>
毗陀耶闍嗔陀夜彌<br/>
雞囉夜彌<br/>
波唎跋囉者迦訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
茶演尼訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
摩訶般輸般怛夜<br/>
嚧陀囉訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
那囉夜拏訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
怛埵伽嚧茶西訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
摩訶迦囉摩怛唎伽拏訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
迦波唎迦訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
闍耶羯囉摩度羯囉<br/>
薩婆囉他娑達那訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
赭咄囉婆耆你訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
毗唎羊訖唎知<br/>
難陀雞沙囉伽拏般帝<br/>
索醯夜訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
那揭那舍囉婆拏訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
阿羅漢訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
毗多囉伽訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
跋闍囉波你<br/>
具醯夜具醯夜<br/>
迦地般帝訖唎擔<br/>
毗陀夜闍嗔陀夜彌<br/>
雞囉夜彌<br/>
囉叉罔<br/>
婆伽梵<br/>
印兔那麼麼寫<br/>
 
(第四會)<br/>
婆伽梵<br/>
薩怛多般怛囉<br/>
南無粹都帝<br/>
阿悉多那囉剌迦<br/>
波囉婆悉普吒<br/>
毗迦薩怛多鉢帝唎<br/>
什佛囉什佛囉<br/>
陀囉陀囉<br/>
頻陀囉頻陀囉嗔陀嗔陀<br/>
虎信<br/>
虎信<br/>
泮吒<br/>
泮吒泮吒泮吒泮吒<br/>
娑訶<br/>
醯醯泮<br/>
阿牟迦耶泮<br/>
阿波囉提訶多泮<br/>
婆囉波囉陀泮<br/>
阿素囉毗陀囉波迦泮<br/>
薩婆提鞞弊泮<br/>
薩婆那伽弊泮<br/>
薩婆藥叉弊泮<br/>
薩婆乾闥婆弊泮<br/>
薩婆補丹那弊泮<br/>
迦吒補丹那弊泮<br/>
薩婆突狼枳帝弊泮<br/>
薩婆突澁比犁訖瑟帝弊泮<br/>
薩婆什婆利弊泮<br/>
薩婆阿播悉摩犁弊泮<br/>
薩婆舍囉婆拏弊泮<br/>
薩婆地帝雞弊泮<br/>
薩婆怛摩陀繼弊泮<br/>
薩婆毗陀耶囉誓遮犁弊泮<br/>
闍夜羯囉摩度羯囉<br/>
薩婆囉他娑陀雞弊泮<br/>
毗地夜遮唎弊泮<br/>
者都囉縛耆你弊泮<br/>
跋闍囉俱摩唎<br/>
毗陀夜囉誓弊泮<br/>
摩訶波囉丁羊乂耆唎弊泮<br/>
跋闍囉商羯囉夜<br/>
波囉丈耆囉闍耶泮<br/>
摩訶迦囉夜<br/>
摩訶末怛唎迦拏<br/>
南無娑羯唎多夜泮<br/>
毖瑟拏婢曳泮<br/>
勃囉訶牟尼曳泮<br/>
阿耆尼曳泮<br/>
摩訶羯唎曳泮<br/>
羯囉檀遲曳泮<br/>
蔑怛唎曳泮<br/>
嘮怛唎曳泮<br/>
遮文茶曳泮<br/>
羯邏囉怛唎曳泮<br/>
迦般唎曳泮<br/>
阿地目質多迦尸摩舍那<br/>
婆私你曳泮<br/>
演吉質<br/>
薩埵婆寫<br/>
麼麼印兔那麼麼寫<br/>

(第五會)<br/>
突瑟吒質多<br/>
阿末怛唎質多<br/>
烏闍訶囉<br/>
伽婆訶囉<br/>
嚧地囉訶囉<br/>
婆娑訶囉<br/>
摩闍訶囉<br/>
闍多訶囉<br/>
視毖多訶囉<br/>
跋略夜訶囉<br/>
乾陀訶囉<br/>
布史波訶囉<br/>
頗囉訶囉<br/>
婆寫訶囉<br/>
般波質多<br/>
突瑟吒質多<br/>
嘮陀囉質多<br/>
藥叉揭囉訶<br/>
囉刹娑揭囉訶<br/>
閉隸多揭囉訶<br/>
毗舍遮揭囉訶<br/>
部多揭囉訶<br/>
鳩槃茶揭囉訶<br/>
悉乾陀揭囉訶<br/>
烏怛摩陀揭囉訶<br/>
車夜揭囉訶<br/>
阿播薩摩囉揭囉訶<br/>
宅袪革茶耆尼揭囉訶<br/>
唎佛帝揭囉訶<br/>
闍彌迦揭囉訶<br/>
舍俱尼揭囉訶<br/>
姥陀囉難地迦揭囉訶<br/>
阿藍婆揭囉訶<br/>
乾度波尼揭囉訶<br/>
什伐囉堙迦醯迦<br/>
墜帝藥迦<br/>
怛隸帝藥迦<br/>
者突託迦<br/>
尼提什伐囉毖釤摩什伐囉<br/>
薄底迦<br/>
鼻底迦<br/>
室隸瑟密迦<br/>
娑你般帝迦<br/>
薩婆什伐囉<br/>
室嚧吉帝<br/>
末陀鞞達嚧制劍<br/>
阿綺嚧鉗<br/>
目佉嚧鉗<br/>
羯唎突嚧鉗<br/>
揭囉訶揭藍<br/>
羯拏輸藍<br/>
憚多輸藍<br/>
迄唎夜輸藍<br/>
末麼輸藍<br/>
跋唎室婆輸藍<br/>
毖栗瑟吒輸藍<br/>
烏陀囉輸藍<br/>
羯知輸藍<br/>
跋悉帝輸藍<br/>
鄔嚧輸藍<br/>
常伽輸藍<br/>
喝悉多輸藍<br/>
跋陀輸藍<br/>
娑房盎伽般囉丈伽輸藍<br/>
部多毖哆茶<br/>
茶耆尼什婆囉<br/>
陀突嚧迦建咄嚧吉知婆路多毗<br/>
薩般嚧訶凌伽<br/>
輸沙怛囉<br/>
娑那羯囉<br/>
毗沙喻迦<br/>
阿耆尼烏陀迦<br/>
末囉鞞囉建跢囉<br/>
阿迦囉蜜唎咄怛斂部迦<br/>
地栗剌吒<br/>
毖唎瑟質迦<br/>
薩婆那俱囉<br/>
肆引伽弊揭囉唎藥叉怛囉芻<br/>
末囉視吠帝釤娑鞞釤<br/>
悉怛多鉢怛囉<br/>
摩訶跋闍嚧瑟尼釤<br/>
摩訶般賴丈耆藍<br/>
夜波突陀舍喻闍那<br/>
辮怛隸拏<br/>
毗陀耶槃曇迦嚧彌<br/>
帝殊槃曇迦嚧彌<br/>
般囉毘陀槃曇迦嚧彌<br/>
哆姪他<br/>
唵<br/>
阿那隸<br/>
毘舍提<br/>
鞞囉跋闍囉陀唎<br/>
槃陀槃陀你<br/>
跋闍囉謗尼泮<br/>
虎信都嚧甕泮<br/>
莎婆訶</td>


    <td v-show="showC">我今敬禮。皈命一切如來應正等覺。皈命一切諸佛大佛頂首。皈命諸大菩薩。至心承事賢聖。普禮一切聖眾。敬禮三世正徧知覺。敬禮大辟支佛。敬禮大阿羅漢。敬禮須陁洹。敬禮斯陁含。敬禮阿那含。敬禮過未現在諸聖賢眾。敬禮諸天仙眾。敬禮咒術天仙聖眾。惟願攝惡行善。皈命大梵天眾。皈命帝釋天主。自在天等眷屬。及諸地祇等眾。護大印咒神將。頂禮世尊。大梵天眾。天將眾。天曹眾。天神眾。天兵眾。天男女眾。如來種族眾。蓮花王種族菩薩眾。金剛族眾。寶王族眾。地祇族眾。各持器仗大力猛將。此即普禮一切賢聖。皈命無量壽佛。普禮如來一切門人。普禮應真一切王族。皈命正覺一切聖賢。敬禮阿閦如來。皈命藥師瑠璃光佛。敬普光娑羅王眾。皈佛大弟子眾。敬禮寶光寶幢王眾。我今皈依敬禮。至今發心願學。我今敬禮結華葢頂。我禮今會諸聖。普求證明。代佛宣物秘密一切神眾。斷他人咒。解去橫死。冤家眾。救拔一切冤苦。解釋一切禁縛。除滅一切惡夢。及不祥事。八萬四千金剛眾。護持千界神眾。打破諸害。護戒神眾。護伽藍一切八部神眾。護法善神。皈戒善神。護五方神兵眾。同上破害。除滅一切諸惡。除滅眾死。天神器仗。消滅火毒。解除水毒。勝莊嚴諸聖眾。大力瞋怒王眾。火天眾。虛空天眾。觀光天眾。大力天神眾。答問神眾。大聖神眾。最勝王眾。摧碎金剛。神眾。降伏一切。金剛力士。金剛寶杵眾。金剛寶劍神。天神力士。天才力士。日月星宮天子。五星二十八宿。謂西方太白星。北方水星。南方熒惑星。中方鎮星。東方歲星等。金剛連鎖甲。金剛童男眾。金剛神女眾。金剛巨手。大明咒藏。四天王太子。三光天王眷屬。毗盧神名。天王部下神眾。大佛頂。光神眾。羅剎神名。金剛使者燈樂香花神眾。擎山金剛神眾。如是恆沙力士等眾。諸佛印咒。警覺一切。押領一切部眾。我等天仙。今當敬禮如來大佛頂咒。各領鎮中。各令加護。總攝諸魔。此摧一切惡鬼。我今警覺八萬四千金剛神王。金剛天仙。各令守護。惟仗世尊威神力故。皈命大佛頂光。我今作禮。千臂大神。千頭大神。千百眼大神。敬禮大輪金剛神。皈命三世諸佛。設此壇場。再敕一切。普令諸部神眾。常護隨從。除王難。除賊難。除火難。除風難。除毒難。除刀難。除兵難。除饑饉難。除雷電難。阿迦下除橫死非命難。得總持力。除一切災害難。除險阻難。除毒蛇難。除毒龍難。除熌電難。除金翅鳥難。守魂鬼。守宮婦女鬼。除非命難。守尸鬼。守穀鬼。除毒藥難。大神鬼。鳩句騎坐鬼。除城郭車騎難。守形鬼。守魄鬼。童子神。羊頭神。熱鬼。影鬼。音鬼。食精氣鬼。食胎藏鬼。食血鬼。食油鬼。食產鬼。食命鬼。食垢膩鬼。食祭鬼。食花鬼。食菓鬼。食五穀種子鬼。食燈鬼。如是等眾。一切熱惱祖父神鬼。大明咒藏。斬依罪者咒。捕捉夜叉王咒。有三神將。押領二十八萬軍眾。狐魅鬼眾。大自在天眾。自在天眾。金翅鳥王神眾。大小黑天神眾。髑髏外道神仙眾。執持一切人物神王軍將。神女姊妹。鬬戰勝神將前器仗。幷及孔雀明王器仗。裸形外道神眾。降伏羅剎王眾。大力神王。執劍金剛神王。及與密跡力士。婆伽梵總管也。仰白世尊。願仗神力普令一切眾生。常蒙加護。再仰佛力華葢。我今敬禮。赤光繚繞。紫光盤簇。白光旋轉。光燄徧照。雲葢。香葢。珠葢。徧滿法界。敕天上地下一切眾。滅除眾惡。收攝不祥。解脫一切。不空我願。願無障礙。所願隨心。破碎修羅。降伏一切天神眾。降伏一切毒龍眾眾。藥叉。降伏一切勇猛。鬼神。降伏一切音樂眾。一切鬼來讚禮。一切鬼奇皈敬。降伏諸魔。降伏諸惡。破諸幽暗。破諸冤業。破諸災厄。破諸冤害。破一切非命。破一切毒氣。解諸重難。解瘧壯熱。降伏外道。解諸惡毒。伏諸厄難。降伏一切惡道。降伏一切苦毒。降伏諸惡毒師。降伏惡毒咒王。伏火天神。降大黑天神女。黑面神玉女眾。天帝釋眾。瞋怒神王。噉人大神。喝山大神。食光大神。諸持作大鬼帥。及一切有力鬼神。普令諸惡鬼神。悉皆摧碎。惡心鬼。惡毒鬼。食精鬼。食胎鬼。食血鬼。食油鬼。食產鬼。食肉鬼。食命鬼。食祭鬼。食香鬼。食花鬼。食菓鬼。食種子鬼。惡形鬼。惡眼鬼。巨頭鬼。以佛菩薩。現千百億身手。降伏一切大力鬼神。藥叉。吞火鬼。吞水鬼。交手鬼。交足鬼。交身鬼。分形鬼。吐烟鬼。吐火鬼。形影鬼。羊頭瞋鬼。刑人狐鬼。狸魅女鬼。惱小兒鬼。形如女面。如烏鬼。如鳥鬼。如猫鬼。如蛇。鬼。如雞鬼。壯熱鬼。一日瘧鬼。二日瘧鬼。三日瘧鬼。五日瘧鬼。常熱鬼。增寒鬼。風病鬼。黃病鬼。疫病鬼。痢病鬼。頭病鬼。不食鬼。口痛鬼。齒痛鬼。唇痛鬼。身病鬼。頤頷痛鬼。心痛鬼。頭痛鬼。兩脇痛鬼。背痛鬼。腹痛鬼。腰痛鬼。踝痛鬼。腿痛鬼。腕痛鬼。兩手痛鬼。四肢骨節痛鬼。兩膊痛鬼。尸林鬼。魅鬼。一切瘡鬼。蜘蛛瘡鬼。疔瘡鬼。漫淫瘡鬼。赤瘡鬼。小兒瘡鬼。顛狂鬼。癩瘡鬼。火毒鬼。水毒鬼。女死鬼。橫死鬼。藥草毒鬼。蝎毒鬼。蛇毒鬼。虎狼毒鬼。獅子毒鬼。一切惡毒鬼。熊羆毒鬼。用制此類一切惡鬼。悉皆畏伏。花葢也。啟火金剛藏王。警力士眾。佛頂光聚大明心咒。不得入我結縛界內。十二由旬結界地面。禁縛諸惡。一切邪魔惡鬼神王。不能進入擾害。此咒能縛諸惡鬼神。我今說此咒心。乃宣佛敕。一切眾類。仰如來力。聞誦此咒。悉當合掌恭敬頂禮。汝等承佛威力。各來衛護。行住坐臥。不相捨離。再嚴伏一切朋黨眷屬。汝等諦聽。各歸其所。向無上道。直至菩提。</td>  
        </tr>

      </tbody>
    </table>
  </q-page>
</template>

<script>
import { defineComponent } from 'vue'

export default defineComponent({
  name: 'IndexPage',
  data () {
    return {
      showA: false,
      showB: true,
      showC: true,
      sources: [
        {
          src: '/lengyen.mp3',
          type: 'audio/mp3'
        },
        {
          src: '/lengyen.ogg',
          type: 'audio/ogg'
        }
      ]
    }
  }
})
</script>
